Revit 2026 API

# ExporterIFCUtilsGetNumBuildingStoreys Method

---

**Note: This API is now obsolete.**

Returns the number of non-empty, non-duplicate building stories in the file.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")]
public static int GetNumBuildingStoreys(
	ExporterIFC exporterIFC
)
```
```vb
<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")>
Public Shared Function GetNumBuildingStoreys (
	exporterIFC As ExporterIFC
) As Integer
```
```cpp
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")]
static int GetNumBuildingStoreys(
	ExporterIFC^ exporterIFC
)
```
```fsharp
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Use ExporterCacheManager.LevelInfoCache.LevelsById.Count instead.")>]
static member GetNumBuildingStoreys :
        exporterIFC : ExporterIFC -> int
```

#### Parameters

exporterIFC ExporterIFC
     The exporter.

#### Return Value

Int32 The number of stories.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace